# Selecting and filtering data from pd table

In [19]:
import pandas as pd
import numpy as np

In [6]:
cars = pd.read_csv('cars.csv', index_col = 0)
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JPN           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [9]:
# Extract drives_right column as Series: dr
dr = cars['drives_right']
dr

US      True
AUS    False
JPN    False
IN     False
RU      True
MOR     True
EG      True
Name: drives_right, dtype: bool

In [5]:
x = cars[dr]
x

     cars_per_cap        country  drives_right
US            809  United States          True
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

## Convert The filtering to one line

In [12]:
sel = cars[cars['drives_right']]
sel

     cars_per_cap        country  drives_right
US            809  United States          True
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

## Filtering data so that cpc selects > 500

In [15]:
cpc = cars['cars_per_cap']
cpc

US     809
AUS    731
JPN    588
IN      18
RU     200
MOR     70
EG      45
Name: cars_per_cap, dtype: int64

In [17]:
more_than_500 = cpc > 500

In [18]:
cars[more_than_500]

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JPN           588          Japan         False

## Select cpc more than 100 and less than 500

In [ ]:
more_than_500_and_less_100 = np.logical_and()